<?php

/**
 * 语言列表信息
 */
class Lang_info
{
    /** 语言列表，下标即为语言代码 */
    public static array $language = [
        '自动识别', '中文', '英语', '韩语', '日语', '法语',
        '俄语', '西班牙语', '葡萄牙语', '印地语', '阿拉伯语',
        '丹麦语', '德语', '希腊语', '芬兰语', '意大利语',
        '马来语', '越南语', '印尼语', '荷兰语', '泰语'
    ];
    /** 语言组合，二维数组，数组项为 `[from, to]` */
    public static array $group = [
        [0, 0], [1, 2], [2, 1], [1, 3], [3, 1],
        [1, 4], [4, 1], [1, 5], [5, 1], [1, 6],
        [6, 1], [1, 7], [7, 1], [1, 8], [8, 1],
        [1, 9], [1, 10], [10, 1], [1, 12], [12, 1],
        [1, 15], [15, 1], [1, 17], [17, 1], [1, 18],
        [18, 1], [1, 19], [19, 1], [1, 20], [20, 1]
    ];
    /** 有道翻译的语言代码，下标对应 `$language` */
    public static array $youdao_lang = [
        'AUTO', 'zh-CHS', 'en', 'ko', 'ja',
        'fr', 'ru', 'es', 'pt', 'hi', 'ar',
        'da', 'de', 'el', 'fi', 'it', 'ms',
        'vi', 'id', 'nl', 'th'
    ];
}
